Revit 2026 API

# TriangulationInterface Properties

---

The TriangulationInterface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

TriangulationInterface Class

Autodesk.Revit.DB Namespace